Enums/упАлгоритмыОбработкиСобытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упАлгоритмыОбработкиСобытия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВключитьЗаданиеВПериодическийРейс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключитьКонтрольныеТочкиВРейсПоПравилам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершитьРейс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачаПользователю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапроситьЗначенияУровняТопливаНаПериодПутевогоЛиста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НапоминаниеПользователю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработатьЗапросУсловийПеревозки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОповеститьПользователя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОптимизироватьМаршрут</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитьЗадание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитьЗаявку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитьРейс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьSMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьЗаявкуНаТСПеревозчику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтразитьЗаправкуСливВПутевомЛистеПоДаннымДатчиков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередатьЗаданиеКПланированию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередатьЗаявкуКВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередатьРейсКВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередатьСледующийВМультимодальнойПеревозкеРейсКВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерейтиКСледующейИтерацииПодбораПеревозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерейтиКСледующемуЭтапуПодбораПеревозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйАлгоритм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетПлановыхДоходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетПлановыхРасходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкорректироватьНачальныеОстаткиВСледующемПутевомЛисте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкорректироватьПланПеревозки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласоватьЗаявку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьЗаданиеНаПеревозкуГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьЗадачуНаПодтверждениеАдреса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьЗадачуНаСогласованиеИзмененийМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьЗаявкуНаВозвратГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьЗаявкуНаВозвратТары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьЗаявкуНаПеревозкуГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьПодтверждениеЗаявкиНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьРейс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьСобытиеМониторингаОпозданиеВТочкеМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьСобытиеМониторингаПланируемоеОпозданиеВТочкеМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписатьПланыПоЗаданиямНаПеревозку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьЗаявкиНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьЗаявкуНаПеревозкуКонтейнера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьУсловияВЗаявкахНаТС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упТипыДействийСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыДействийСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаписьЗаданияНаПеревозкуГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьЗадачиИсполнителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьЗадачиНаОтправкуФайлов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьЗапросаУсловийПеревозки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьЗаявкиНаПеревозкуГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьПодтвержденияЗаявкиНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьПредложенияПеревозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьПрохождениеТочки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьПутевогоЛиста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьРейса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьОперацийСКонтейнером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьСобытияМониторинга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьФактическихРасходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеМаршрутаПоРейсу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеРаботПоРейсу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаЗаданияНаПеревозку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаЗапросаУсловийПеревозки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаЗаявкиНаПеревозку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаЗаявкиНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаПутевогоЛиста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаРейса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаОперацийСКонтейнером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеЭкипажаПоРейсу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрисоединениеФайла</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упАлгоритмыОбработкиСобытия/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ТипИсходногоДействия = Неопределено;
	Если Параметры.Отбор.Свойство("ТипИсходногоДействия", ТипИсходногоДействия) Тогда 
		СтандартнаяОбработка = Ложь;
		
		СписокСсылок = Новый СписокЗначений;
		СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПроизвольныйАлгоритм);
		Если ПолучитьФункциональнуюОпцию("ИспользоватьНапоминанияПользователя") Тогда
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.НапоминаниеПользователю);
		КонецЕсли;
		СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОповеститьПользователя);
		СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОтправитьSMS);
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьБизнесПроцессыИЗадачи") Тогда
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ЗадачаПользователю);
		КонецЕсли;
		
		Если ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеСтатусаЗаявкиНаПеревозку")  Тогда
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьЗаданиеНаПеревозкуГруза);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПередатьЗаявкуКВыполнению);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СогласоватьЗаявку);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПередатьЗаданиеКПланированию);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.РасчетПлановыхДоходов);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьЗаявкуНаВозвратГруза);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьЗаявкуНаВозвратТары);	
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьЗаявкиНаПеревозкуГруза") Тогда
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПередатьЗаявкуКВыполнению);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СогласоватьЗаявку);
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПередатьЗаданиеКПланированию);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.РасчетПлановыхДоходов);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьЗаявкуНаВозвратГруза);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьЗаявкуНаВозвратТары);
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеСтатусаЗаданияНаПеревозку") Тогда	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьРейс);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПередатьЗаданиеКПланированию);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ВключитьЗаданиеВПериодическийРейс);	
			Если ПолучитьФункциональнуюОпцию("упИспользуютсяМультимодальныеПеревозки") Тогда
				СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПередатьСледующийВМультимодальнойПеревозкеРейсКВыполнению);	
			КонецЕсли;
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьЗаданияНаПеревозкуГруза") Тогда	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПередатьЗаданиеКПланированию);
			Если ПолучитьФункциональнуюОпцию("упИспользуютсяМультимодальныеПеревозки") Тогда
				СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПередатьСледующийВМультимодальнойПеревозкеРейсКВыполнению);	
			КонецЕсли;
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеСтатусаРейса") Тогда	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ВключитьКонтрольныеТочкиВРейсПоПравилам);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СформироватьЗаявкиНаТС);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПередатьРейсКВыполнению);
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ЗавершитьРейс);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОтменитьРейс);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.РасчетПлановыхРасходов);		
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СписатьПланыПоЗаданиямНаПеревозку);
			Если ПолучитьФункциональнуюОпцию("упИспользуютсяМультимодальныеПеревозки") Тогда
				СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СкорректироватьПланПеревозки);
			КонецЕсли;
						
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьРейса") Тогда	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ВключитьКонтрольныеТочкиВРейсПоПравилам);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СформироватьЗаявкиНаТС);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОбновитьУсловияВЗаявкахНаТС);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПередатьРейсКВыполнению);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ЗавершитьРейс);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОтменитьРейс);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.РасчетПлановыхРасходов);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СписатьПланыПоЗаданиямНаПеревозку);
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьПодтвержденияЗаявкиНаТС") Тогда			
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПередатьРейсКВыполнению);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОтменитьРейс);	
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеСтатусаЗаявкиНаТС") Тогда			
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОтправитьЗаявкуНаТСПеревозчику);	
			Если ПолучитьФункциональнуюОпцию("упИспользуютсяИтерацииОформленияЗаявокНаТС") Тогда 
				СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПерейтиКСледующейИтерацииПодбораПеревозчика);	
				СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПерейтиКСледующемуЭтапуПодбораПеревозчика);	
			КонецЕсли;	
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьПутевогоЛиста") 
			ИЛИ ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеСтатусаПутевогоЛиста")  Тогда			
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПередатьРейсКВыполнению);
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СкорректироватьНачальныеОстаткиВСледующемПутевомЛисте);
			Если ПолучитьФункциональнуюОпцию("упИспользуетсяГлобальнаяПодсистемаСпутниковыйМониторинг") Тогда 
				СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ЗапроситьЗначенияУровняТопливаНаПериодПутевогоЛиста);	
			КонецЕсли;	
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьПредложенияПеревозчика") Тогда			
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьПодтверждениеЗаявкиНаТС);
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеМаршрутаПоРейсу") Тогда	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ВключитьКонтрольныеТочкиВРейсПоПравилам);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОптимизироватьМаршрут);
			Если ПолучитьФункциональнуюОпцию("упИспользуетсяГлобальнаяПодсистемаСпутниковыйМониторинг") Тогда
				СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьСобытиеМониторингаОпозданиеВТочкеМаршрута);
				СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьСобытиеМониторингаПланируемоеОпозданиеВТочкеМаршрута);
			КонецЕсли; 
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьСобытияМониторинга") Тогда
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОптимизироватьМаршрут);
			Если ПолучитьФункциональнуюОпцию("упИспользуетсяГлобальнаяПодсистемаСпутниковыйМониторинг") Тогда
				СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОтразитьЗаправкуСливВПутевомЛистеПоДаннымДатчиков);
			КонецЕсли; 	
			Если ПолучитьФункциональнуюОпцию("ИспользоватьБизнесПроцессыИЗадачи") Тогда
				СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьЗадачуНаПодтверждениеАдреса);
				СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьЗадачуНаСогласованиеИзмененийМаршрута);
			КонецЕсли;
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ПрисоединениеФайла") Тогда			
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПроизвольныйАлгоритм);
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьЗапросаУсловийПеревозки") Тогда			
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОбработатьЗапросУсловийПеревозки);
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьЗаявкуНаПеревозкуГруза);
			
	     ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеСтатусаЗапросаУсловийПеревозки") Тогда			
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьЗаявкуНаПеревозкуГруза);
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьЗадачиНаОтправкуФайлов") Тогда			
			СписокСсылок.Очистить();
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ЗадачаПользователю);
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОповеститьПользователя);
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОтправитьSMS);
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПроизвольныйАлгоритм);
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьЗадачиИсполнителя") Тогда			
			СписокСсылок.Очистить();
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПроизвольныйАлгоритм);
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.НапоминаниеПользователю);
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОповеститьПользователя);
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОтправитьSMS);
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьОперацийСКонтейнером")
			Или ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеСтатусаОперацийСКонтейнером") Тогда
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьЗаявкуНаПеревозкуКонтейнера);
			
		КонецЕсли;
		
		СписокИсключений = Новый СписокЗначений;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	тбАлгоритмыОбработкиСобытия.Ссылка
		               |ИЗ
		               |	Перечисление.упАлгоритмыОбработкиСобытия КАК тбАлгоритмыОбработкиСобытия
		               |ГДЕ
		               |	тбАлгоритмыОбработкиСобытия.Ссылка В(&Список)
		               |	И НЕ тбАлгоритмыОбработкиСобытия.Ссылка В (&СписокИсключений)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	тбАлгоритмыОбработкиСобытия.Порядок";
		Запрос.УстановитьПараметр("Список",           СписокСсылок);
		Запрос.УстановитьПараметр("СписокИсключений", СписокИсключений);
		
		ДанныеВыбора = Новый СписокЗначений;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			ДанныеВыбора.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти
